#pragma once

#include "util/type.h"

#include <string>
#include <charconv>

namespace Pupil::material {
struct DielectricIorEntry {
    const char *name;
    float value;
};

struct ConductorIorEntry {
    const char *name;
    util::Float3 eta;
    util::Float3 k;
};

// clang-format off
/**
* Many values are taken from Hecht, Optics,
* Fourth Edition.
*
* The IOR values are from measurements between
* 0 and 20 degrees celsius at ~589 nm.
*/
const static DielectricIorEntry S_DIELECTRIC_IOR_DATA[] = {
    { "vacuum",                1.0f },
    { "helium",                1.000036f },
    { "hydrogen",              1.000132f },
    { "air",                   1.000277f },
    { "carbon dioxide",        1.00045f },
    //////////////////////////////////////
    { "water",                 1.3330f },
    { "acetone",               1.36f },
    { "ethanol",               1.361f },
    { "carbon tetrachloride",  1.461f },
    { "glycerol",              1.4729f },
    { "benzene",               1.501f },
    { "silicone oil",          1.52045f },
    { "bromine",               1.661f },
    //////////////////////////////////////
    { "water ice",             1.31f },
    { "fused quartz",          1.458f },
    { "pyrex",                 1.470f },
    { "acrylic glass",         1.49f },
    { "polypropylene",         1.49f },
    { "bk7",                   1.5046f },
    { "sodium chloride",       1.544f },
    { "amber",                 1.55f },
    { "pet",                   1.5750f },
    { "diamond",               2.419f },

    { nullptr,                 0.0f }
};

// from https://github.com/zhiwei-c/Monte-Carlo-Path-Tracing.git
const static ConductorIorEntry S_CONDUCTOR_IOR_DATA[] = {
    //无定形碳 Amorphous carbon
    {"a-C",         {2.93785, 2.22242, 1.96400},    {0.88555, 0.79763, 0.81356}},
    //银 Silver
    {"Ag",          {0.15494, 0.11648, 0.13809},    {4.81810, 3.11562, 2.14240}},
    //铝 Aluminium
    {"Al",          {1.65394, 0.87850, 0.52012},    {9.20430, 6.25621, 4.82675}},
    //氧化铝 Aluminium oxide
    {"Al2O3",       {2.12296, 1.67556, 1.61569},    {2.11325, 1.66785, 1.60811}},
    //立方砷化铝 Cubic aluminium arsenide
    {"AlAs",        {3.59737, 3.22615, 2.21235},    {0.00067, -0.00050, 0.00741}},
    {"AlAs_palik",  {3.59737, 3.22615, 2.21235},    {0.00067, -0.00050, 0.00741}},
    //立方锑化铝 Cubic aluminium antimonide
    {"AlSb",        {4.70830, 4.05196, 4.57419},    {-0.02918, 0.09345, 1.29784}},
    {"AlSb_palik",  {4.70830, 4.05196, 4.57419},    {-0.02918, 0.09345, 1.29784}},
    //金 Gold
    {"Au",          {0.14282, 0.37414, 1.43944},    {3.97472, 2.38066, 1.59981}},
    //多晶铍 Polycrystalline beryllium
    {"Be",          {4.17618, 3.17830, 2.77819},    {3.82730, 3.00374, 2.86293}},
    {"Be_palik",    {4.17618, 3.17830, 2.77819},    {3.82730, 3.00374, 2.86293}},
    //铬 Chromium
    {"Cr",          {4.36041, 2.91052, 1.65119},    {5.19538, 4.22239, 3.74700}},
    //立方碘化铯 Cubic caesium iodide
    {"CsI",         {2.14035, 1.69870, 1.65890},    {0.00000, 0.00000, 0.00000}},
    {"CsI_palik",   {2.14035, 1.69870, 1.65890},    {0.00000, 0.00000, 0.00000}},
    //铜 Copper
    {"Cu",          {0.19999, 0.92209, 1.09988},    {3.90464, 2.44763, 2.13765}},
    {"Cu_palik",    {0.21221, 0.91805, 1.10007},    {3.91324, 2.45193, 2.13213}},
    //氧化亚铜 Cuprous oxide
    {"Cu2O",        {3.54426, 2.94365, 2.74619},    {0.11395, 0.19341, 0.60475}},
    {"Cu2O_palik",  {3.54426, 2.94365, 2.74619},    {0.11395, 0.19341, 0.60475}},
    //氧化铜 Cupric oxide
    {"CuO",         {3.24062, 2.44261, 2.20556},    {0.51999, 0.56882, 0.72064}},
    {"CuO_palik",   {3.24062, 2.44261, 2.20556},    {0.51999, 0.56882, 0.72064}},
    //立方金刚石 Cubic diamond
    {"d-C",         {2.90008, 2.29322, 2.22275},    {0.00000, 0.00000, 0.00000}},
    {"d-C_palik",   {2.90008, 2.29322, 2.22275},    {0.00000, 0.00000, 0.00000}},
    //铁 Iron
    {"Fe",          {2.76404, 1.95417, 1.62766},    {3.83077, 2.73841, 2.31812}},
    //氮化镓 Gallium nitride
    {"GaN",         {2.86583, 2.29184, 2.29848},    {0.00020, -0.00017, 0.00128}},
    //锗 Germanium
    {"Ge",          {7.05832, 4.78868, 3.57814},    {0.50903, 2.19196, 2.05716}},
    //汞 Mercury
    {"Hg",          {2.39384, 1.43697, 0.90762},    {6.31420, 4.36266, 3.41454}},
    {"Hg_palik",    {2.39384, 1.43697, 0.90762},    {6.31420, 4.36266, 3.41454}},
    //碲化汞 Mercury telluride
    {"HgTe",        {4.76940, 3.22413, 2.65439},    {1.62853, 1.57746, 1.72592}},
    {"HgTe_palik",  {4.76940, 3.22413, 2.65439},    {1.62853, 1.57746, 1.72592}},
    //铱 Iridium
    {"Ir",          {3.07986, 2.07777, 1.61446},    {5.58028, 4.05855, 3.26033}},
    {"Ir_palik",    {3.07986, 2.07777, 1.61446},    {5.58028, 4.05855, 3.26033}},
    //多晶钾 Polycrystalline potassium
    {"K",           {0.06391, 0.04631, 0.03810},    {2.09975, 1.34607, 0.91128}},
    {"K_palik",     {0.06391, 0.04631, 0.03810},    {2.09975, 1.34607, 0.91128}},
    //锂 Lithium
    {"Li",          {0.26525, 0.19519, 0.22045},    {3.53305, 2.30618, 1.66505}},
    {"Li_palik",    {0.26525, 0.19519, 0.22045},    {3.53305, 2.30618, 1.66505}},
    //氧化镁 Magnesium oxide
    {"MgO",         {2.08521, 1.64721, 1.59150},    {0.00000, -0.00000, 0.00000}},
    {"MgO_palik",   {2.08521, 1.64721, 1.59150},    {0.00000, -0.00000, 0.00000}},
    //钼 Molybdenum
    {"Mo",          {4.47417, 3.51799, 2.77018},    {4.10240, 3.41361, 3.14393}},
    {"Mo_palik",    {4.47417, 3.51799, 2.77018},    {4.10240, 3.41361, 3.14393}},
    //钠 Sodium
    {"Na",          {0.06014, 0.05602, 0.06186},    {3.17254, 2.10800, 1.57575}},
    {"Na_palik",    {0.06014, 0.05602, 0.06186},    {3.17254, 2.10800, 1.57575}},
    //铌 Niobium
    {"Nb",          {3.41288, 2.78427, 2.39051},    {3.43408, 2.73183, 2.57445}},
    {"Nb_palik",    {3.41288, 2.78427, 2.39051},    {3.43408, 2.73183, 2.57445}},
    //镍 Nickel
    {"Ni",          {2.36225, 1.65983, 1.46395},    {4.48929, 3.04369, 2.34046}},
    {"Ni_palik",    {2.36225, 1.65983, 1.46395},    {4.48929, 3.04369, 2.34046}},
    //铑 Rhodium
    {"Rh",          {2.58031, 1.85624, 1.55114},    {6.76790, 4.69297, 3.96766}},
    {"Rh_palik",    {2.58031, 1.85624, 1.55114},    {6.76790, 4.69297, 3.96766}},
    //硒 Selenium
    {"Se",          {4.08037, 2.83343, 2.81458},    {0.75378, 0.63705, 0.52047}},
    {"Se_palik",    {4.08037, 2.83343, 2.81458},    {0.75378, 0.63705, 0.52047}},
    //六方碳化硅 Hexagonal silicon carbide
    {"SiC",         {3.16562, 2.52061, 2.47411},    {0.00000, -0.00000, 0.00001}},
    {"SiC_palik",   {3.16562, 2.52061, 2.47411},    {0.00000, -0.00000, 0.00001}},
    //碲化锡 Tin telluride
    {"SnTe",        {4.51562, 1.97692, 1.27897},    {0.00000, 0.00000, 0.00000}},
    {"SnTe_palik",  {4.51562, 1.97692, 1.27897},    {0.00000, 0.00000, 0.00000}},
    //钽 Tantalum
    {"Ta",          {2.05820, 2.38802, 2.62250},    {2.40293, 1.73767, 1.94291}},
    {"Ta_palik",    {2.05820, 2.38802, 2.62250},    {2.40293, 1.73767, 1.94291}},
    //三方碲 Trigonal tellurium
    {"Te",          {7.37519, 4.47257, 2.63149},    {3.24919, 3.51992, 3.28521}},
    {"Te_palik",    {7.37519, 4.47257, 2.63149},    {3.24919, 3.51992, 3.28521}},
    //多晶四氟化钍 Polycryst. thorium tetrafluoride
    {"ThF4",        {1.82684, 1.43917, 1.38471},    {0.00000, 0.00000, 0.00000}},
    {"ThF4_palik",  {1.82684, 1.43917, 1.38471},    {0.00000, 0.00000, 0.00000}},
    //多晶碳化钛 Polycrystalline titanium carbide
    {"TiC",         {3.69261, 2.83141, 2.57683},    {3.25876, 2.34656, 2.16818}},
    {"TiC_palik",   {3.69261, 2.83141, 2.57683},    {3.25876, 2.34656, 2.16818}},
    //氮化钛 Titanium nitride
    {"TiN",         {1.64497, 1.14800, 1.37685},    {3.36132, 1.93936, 1.09967}},
    {"TiN_palik",   {1.64497, 1.14800, 1.37685},    {3.36132, 1.93936, 1.09967}},
    //四方二氧化钛 Tetragonal titanium dioxide
    {"TiO2",        {3.44929, 2.79576, 2.89899},    {0.00010, -0.00009, 0.00063}},
    {"TiO2_palik",  {3.44929, 2.79576, 2.89899},    {0.00010, -0.00009, 0.00063}},
    //碳化钒 Vanadium carbide
    {"VC",          {3.64981, 2.74689, 2.52731},    {3.06184, 2.19400, 1.95902}},
    {"VC_palik",    {3.64981, 2.74689, 2.52731},    {3.06184, 2.19400, 1.95902}},
    //钒 Vanadium
    {"V",           {4.26843, 3.50571, 2.75528},    {3.48377, 2.88322, 3.10511}},
    {"V_palik",     {4.26843, 3.50571, 2.75528},    {3.48377, 2.88322, 3.10511}},
    //氮化钒 Vanadium nitride
    {"VN",          {2.85952, 2.11468, 1.93597},    {3.02590, 2.05174, 1.61287}},
    {"VN_palik",    {2.85952, 2.11468, 1.93597},    {3.02590, 2.05174, 1.61287}},
    //钨 Tungsten
    {"W",           {4.36142, 3.29330, 2.99191},    {3.49325, 2.59934, 2.26838}},
    // 100% 反射镜面
    {"none",        {0,       0,       0},          {1,       1,       1}}
};
// clang-format on

static float LoadDielectricIor(std::string_view str, float default_value) noexcept {
    if (str.empty()) return default_value;

    float value;
    auto [p, ec] = std::from_chars(str.data(), str.data() + str.size(), value);
    if (ec == std::errc() && p == str.data() + str.size())
        return value;

    for (auto &[name, ior] : S_DIELECTRIC_IOR_DATA) {
        if (name != nullptr && str.compare(name) == 0) {
            return ior;
        }
    }

    return default_value;
}

// default is none
static bool LoadConductorIor(std::string_view name, util::Float3 &eta, util::Float3 &k) noexcept {
    if (name.empty()) return false;

    for (auto &[name_, eta_, k_] : S_CONDUCTOR_IOR_DATA) {
        if (name_ != nullptr && name.compare(name_) == 0) {
            eta = eta_;
            k = k_;
            return true;
        }
    }
    return false;
}

}// namespace Pupil::material